Autodesk.Revit.DB.Structure.FabricSheet.SetBendProfile(Autodesk.Revit.DB.CurveLoop)
Sets new profile that defines the shape of the Fabric Sheet bending.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for U shape, only three lines not three lines and two arcs),
if so, then fillets (two arcs) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when bend profile contains an overlap or intersecting segments.
-or-
Thrown when bend profile is empty.
-or-
Thrown when bend profile contains an empty loop.
-or-
Thrown when bend profile contains multiple loops.
-or-
Thrown when bend profile contains a closed loop.
-or-
Thrown when bend profile contains arcs that are not distracted by a line.
-or-
Thrown when bend profile contains too short segments, so fillet can't be added.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.GetBendProfileWithFillets
Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending.
Remarks:
Returned curve loop is created automatically as a result of adding fillets to bend profile.
The returned profile defines the center-curve of a wire.
Note that bent Fabric Sheets can have planar geometry, but flat Fabric Sheets are always planar.
Returns:
The bend profile with generated fillets that defines the shape of the fabric fheet bending for bent fabric sheet,
for flat fabric sheet null will be returned.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop)
Creates a new instance of a single bent Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
concreteHostElementId:
The element that will host the FabricSheet.
The host can be a Structural Floor, Structural Wall, Structural Slab, Structural Floor Edge, Structural Slab Edge,
Structural Column, Beam and Brace.
Also, host can be a Autodesk::Revit::DB::Part created from a structural layer of Structural Floor, Structural Wall or Structural Slab.
fabricSheetTypeId:
The id of the FabricSheetType.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for U shape, only three lines not three lines and two arcs),
if so, then fillets (two arcs) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Returns:
The instance of the newly created bent fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
concreteHostElementId is not a valid ElementId for the host Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
-or-
Thrown when bend profile contains an overlap or intersecting segments.
-or-
Thrown when bend profile is empty.
-or-
Thrown when bend profile contains an empty loop.
-or-
Thrown when bend profile contains multiple loops.
-or-
Thrown when bend profile contains a closed loop.
-or-
Thrown when bend profile contains arcs that are not distracted by a line.
-or-
Thrown when bend profile contains too short segments, so fillet can't be added.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricWiresOrientation
Specifies the placement of the non-bent bars in the fabric sheet.
Remarks:
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016